In [107]:
import numpy as np
import pandas as pd

In [108]:
cd = pd.read_csv(r"C:\Users\Hp\Downloads\0000000000002429_training_titanic_x_y_train.csv")
cd1 = pd.read_csv(r"C:\Users\Hp\Downloads\0000000000002429_test_titanic_x_test.csv")

In [109]:
from sklearn.linear_model import LogisticRegression

In [110]:
cd1.shape

(223, 10)

In [111]:
cd

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,2,"Weisz, Mrs. Leopold (Mathilde Francoise Pede)",female,29.0,1,0,228414,26.0000,NaN,S,1
1,3,"Williams, Mr. Howard Hugh ""Harry""",male,NaN,0,0,A/5 2466,8.0500,NaN,S,0
2,2,"Morley, Mr. Henry Samuel (""Mr Henry Marshall"")",male,39.0,0,0,250655,26.0000,NaN,S,0
3,3,"Palsson, Mrs. Nils (Alma Cornelia Berglund)",female,29.0,0,4,349909,21.0750,NaN,S,0
4,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S,0
...,...,...,...,...,...,...,...,...,...,...,...
663,2,"Ilett, Miss. Bertha",female,17.0,0,0,SO/C 14885,10.5000,NaN,S,1
664,3,"Morrow, Mr. Thomas Rowan",male,NaN,0,0,372622,7.7500,NaN,Q,0
665,3,"Bing, Mr. Lee",male,32.0,0,0,1601,56.4958,NaN,S,1
666,3,"Strandberg, Miss. Ida Sofia",female,22.0,0,0,7553,9.8375,NaN,S,0
667,3,"Murphy, Miss. Katherine ""Kate""",female,NaN,1,0,367230,15.5000,NaN,Q,1

In [112]:
cd.isnull().sum()

Pclass        0
Name          0
Sex           0
Age         132
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin       514
Embarked      1
Survived      0
dtype: int64

In [113]:
print('Percent of missing "Age" records is %.2f%%' %((cd['Age'].isnull().sum()/cd.shape[0])*100))

Percent of missing "Age" records is 19.76%

In [114]:
print('The mean of "Age" is %.2f' %(cd["Age"].mean(skipna=True)))
# median age
print('The median of "Age" is %.2f' %(cd["Age"].median(skipna=True)))

The mean of "Age" is 29.70
The median of "Age" is 29.00

In [115]:
print('Percent of missing "Cabin" records is %.2f%%' %((cd['Cabin'].isnull().sum()/cd.shape[0])*100))

Percent of missing "Cabin" records is 76.95%

In [116]:
print('Percent of missing "Embarked" records is %.2f%%' %((cd['Embarked'].isnull().sum()/cd.shape[0])*100))

Percent of missing "Embarked" records is 0.15%

In [117]:
print('The most common boarding port of embarkation is %s.' %cd['Embarked'].value_counts().idxmax())

The most common boarding port of embarkation is S.

In [119]:
train_data = cd.copy()
train_data["Age"].fillna(cd["Age"].mean(skipna=True), inplace=True)
train_data["Embarked"].fillna(cd['Embarked'].value_counts().idxmax(), inplace=True)
train_data.drop('Cabin', axis=1, inplace=True)

In [120]:
train_data.isnull().sum()

Pclass      0
Name        0
Sex         0
Age         0
SibSp       0
Parch       0
Ticket      0
Fare        0
Embarked    0
Survived    0
dtype: int64

In [121]:
train_data['TravelAlone']=np.where((train_data["SibSp"]+train_data["Parch"])>0, 0, 1)
train_data.drop('SibSp', axis=1, inplace=True)
train_data.drop('Parch', axis=1, inplace=True)

In [122]:
training=pd.get_dummies(train_data, columns=["Pclass","Embarked","Sex"])
training.drop('Sex_female', axis=1, inplace=True)

training.drop('Name', axis=1, inplace=True)
training.drop('Ticket', axis=1, inplace=True)

final_train = training
final_train.head()

,Age,Fare,Survived,TravelAlone,Pclass_1,Pclass_2,Pclass_3,Embarked_C,Embarked_Q,Embarked_S,Sex_male
0,29.00000,26.000,1,0,0,1,0,0,0,1,0
1,29.70056,8.050,0,1,0,0,1,0,0,1,1
2,39.00000,26.000,0,1,0,1,0,0,0,1,1
3,29.00000,21.075,0,0,0,0,1,0,0,1,0
4,25.00000,7.050,0,1,0,0,1,0,0,1,1

In [123]:
test_data = cd1.copy()
test_data["Age"].fillna(cd1["Age"].median(skipna=True), inplace=True)
test_data["Fare"].fillna(cd1["Fare"].median(skipna=True), inplace=True)
test_data.drop('Cabin', axis=1, inplace=True)

test_data['TravelAlone']=np.where((test_data["SibSp"]+test_data["Parch"])>0, 0, 1)

test_data.drop('SibSp', axis=1, inplace=True)
test_data.drop('Parch', axis=1, inplace=True)

testing = pd.get_dummies(test_data, columns=["Pclass","Embarked","Sex"])
testing.drop('Sex_female', axis=1, inplace=True)

testing.drop('Name', axis=1, inplace=True)
testing.drop('Ticket', axis=1, inplace=True)

final_test = testing
final_test.head()

,Age,Fare,TravelAlone,Pclass_1,Pclass_2,Pclass_3,Embarked_C,Embarked_Q,Embarked_S,Sex_male
0,8.0,36.7500,0,0,1,0,0,0,1,1
1,49.0,25.9292,1,1,0,0,0,0,1,0
2,27.0,7.7375,1,0,0,1,0,1,0,1
3,24.0,27.0000,0,0,1,0,0,0,1,0
4,36.0,26.2875,1,1,0,0,0,0,1,1

In [124]:
final_train['IsMinor']=np.where(final_train['Age']<=16, 1, 0)

final_test['IsMinor']=np.where(final_test['Age']<=16, 1, 0)

In [125]:
from sklearn.linear_model import LogisticRegression
from sklearn.preprocessing import StandardScaler

cols = ["Age","Fare","TravelAlone","Pclass_1","Pclass_2","Embarked_C","Embarked_S","Embarked_Q","Sex_male","IsMinor"] 
X = final_train[cols]
y = final_train['Survived']

scaler = StandardScaler()
scaler.fit(X)
x = scaler.transform(X)



# Build a logreg and compute the feature importances
model = LogisticRegression()
model.fit(x,y)

LogisticRegression()

In [126]:
model.score(x,y)

0.8008982035928144

In [127]:
cols = ["Age","Fare","TravelAlone","Pclass_1","Pclass_2","Embarked_C","Embarked_Q","Embarked_S","Sex_male","IsMinor"] 
b = final_test[cols]
scaler.fit(b)
x1 = scaler.transform(b)




y_pred = model.predict(x1)
print(y_pred)

[1 1 0 1 0 0 0 0 1 0 1 0 1 1 0 0 0 0 0 1 0 0 1 1 0 1 0 0 1 1 0 0 0 0 0 1 1
 1 0 0 0 0 0 0 1 1 0 0 0 0 0 1 1 1 0 0 0 0 0 0 0 0 1 0 1 0 0 1 1 0 0 0 1 0
 0 1 1 0 0 0 0 0 0 0 0 1 1 1 0 0 1 0 0 1 0 0 0 0 0 1 0 0 1 0 1 1 0 0 0 0 0
 1 1 0 1 0 0 0 0 0 0 0 0 0 1 0 0 0 0 1 0 0 0 0 0 0 0 1 1 0 0 0 0 0 0 0 0 0
 0 1 1 0 1 0 1 0 0 1 0 0 0 1 1 0 1 0 1 0 1 0 1 1 1 0 1 0 0 0 0 1 0 0 0 1 1
 0 1 0 1 0 0 0 1 0 0 1 1 1 1 1 0 1 0 0 0 0 0 0 1 1 0 1 0 0 1 1 0 0 0 0 1 0
 0]

In [128]:
np.savetxt('hello1.csv',y_pred, fmt = "%.8f")